IMAGE_X dw 0 ;.............................................. RightToLeft x
IMAGE_Y dw 0 ;.............................................. TopToBottom y

IMAGE_LEFT_END dw 0
IMAGE_BOTTOM_END dw 0

;###########################################################

draw_image:
	
	mov 	ax, 0xA000
	mov 	es, ax
	
	
	mov 	bx, word [IMAGE_X]
	push 	bx
	
	mov 	ax, word [gs:si] ;.............................. кбж ЧсецбЩ
	mov 	word[IMAGE_LEFT_END], bx
	sub 	word[IMAGE_LEFT_END], ax ;...................... ЧсЭЯцЯ Чсэгбь ссецбЩ = кбж ЧсецбЩ + Чсуцок ЧсУноэ ссецбЩ (г)
	
	mov 	cx, word [IMAGE_Y]
	
	mov 	ax, word [gs:si + 2] ;.......................... ЧбЪнЧк ЧсецбЩ
	mov 	word [IMAGE_BOTTOM_END], cx
	add 	word [IMAGE_BOTTOM_END], ax ;................... ЧсЭЯцЯ ЧсгнсэЩ ссецбЩ = ЧбЪнЧк ЧсецбЩ + Чсуцок ЧскуцЯэ ссецбЩ (к)
	
	add 	si, 4 ;......................................... ШэЧфЧЪ ЧсецбЩ ЪШЯУ ШкЯ Чскбж цЧсЧбЪнЧк(пс уфхЧ эуЫс ЫуЧфэ ужЧкн)
	
	mov 	ax, 320
	mul 	cx
	
	xor 	dx, dx
	
	.draw_pixels_loop:
		
		mov 	dl, byte [gs:si] ;.......................... ЧсфоиЩ ЧсЪЧсэЩ (пс фоиЩ ЪуЫс кф ибэо ЫуЧфэ цЧЭЯ)
		cmp 	dl, 0 ;..................................... ЧсоэуЩ 0 Ъкфэ Уф хах фоиЩ днЧнЩЁ ШХупЧффЧ ХуЧ ЪЬЧхсхЧ цкЯу бгухЧ Уц бгухЧ ШЧгЪкуЧс сцф ЧсЮснэЩ
		je 		.ignore
		dec 	dl ;........................................ Чссцф = оэуЩ Чссцф уф ШэЧфЧЪ ЧсецбЩ - 1
		
		mov 	di, ax
		add 	di, bx ;.................................... уцжк бгу ЧсфоиЩ ЧсЭЧсэЩ = кбж ЧсдЧдЩ(320 фоиЩ) з Чсуцок ЧскуцЯэ ссецбЩ + Чсуцок ЧсУноэ ссецбЩ
		
		mov 	byte [es:di], dl ;.......................... фжк Чссцф нэ ЧсупЧф ЧсуфЧгШ ксь уцжк ЧсаЧпбЩ ЧсуЮее ссдЧдкЩ [0xA000:DI]
		
		.ignore:
		
		inc 	si ;........................................ ЧсфоиЩ ЧсЪЧсэЩ
		dec 	bx
		cmp 	bx, word[IMAGE_LEFT_END] ;.................. хс цесфЧ Хсь фхЧэЩ гиб ЧсфоЧи ЧсЮЧеЩ ШЧсецбЩП (Чсаэ хц фнгх кбж ЧсецбЩ)
		je 		.next_pixels_row ;.......................... фкуП ЧфЪос сбгу гиб ЧсфоЧи ЧсЪЧсэ
		jmp 	.draw_pixels_loop ;......................... сЧП Упус бгу ШоэЩ фоЧи Чсгиб
		
	.next_pixels_row:
		
		pop 	bx ;........................................ кбж ЧсецбЩ
		inc 	cx ;........................................ Чсгиб ЧсЪЧсэ уф ЧсфоЧи
		cmp 	cx, word[IMAGE_BOTTOM_END] ;................ хс пЧф хаЧ УЮб гиб уф ЧсфоЧи нэ ЧсецбЩП
		je 		.return ;................................... фкуП ХфхЧС Чсбгу
		
		push 	bx ;........................................ Энй кбж ЧсецбЩ сбгу ШоэЩ ЧсУгиб
		
		mov 	ax, 320
		mul 	cx
		
		jmp 	.draw_pixels_loop ;......................... ЧскцЯЩ сбгу ШоэЩ фоЧи ЧсецбЩ
		
	.return:
	
		ret
